Repository: trapplab/NFC-Radio
Catalog: lib/l10n/app_*.arb
Languages: es, fr, it

source: App Version
fr: Version de l'application
it: Versione dell'applicazione

# settingsTitle
source: Settings
es: Configuración
fr: Paramètres
it: Impostazioni

# audioPacksTitle
source: Audio Packs
es: Paquetes de audio
fr: Packs audio
it: Pacchetti audio

source: Audio Starter Packs
es: Paquetes de inicio de audio
fr: Packs de démarrage audio
it: Pacchetti audio di avvio

# browseAudioOnly
source: Browse audio files only
es: Examinar solo archivos de audio
fr: Parcourir uniquement les fichiers audio
it: Sfoglia solo file audio

source: Filter: audio/*
es: Filtro: audio/*
fr: Filtre: audio/*
it: Filtro: audio/*

# filterAll
source: Filter: */*
es: Filtro: */*
fr: Filtre: */*
it: Filtro: */*

source: Use kiosk mode
es: Usar modo quiosco
fr: Utiliser le mode kiosque
it: Usa modalità chiosco

# requiresSystemAlertPermission
source: Requires SYSTEM_ALERT_WINDOW permission
es: Requiere permiso SYSTEM_ALERT_WINDOW
fr: Nécessite la permission SYSTEM_ALERT_WINDOW
it: Richiede il permesso SYSTEM_ALERT_WINDOW

# nfcNotAvailable
source: NFC is not available on this device.
es: NFC no está disponible en este dispositivo.
fr: Le NFC n'est pas disponible sur cet appareil.
it: NFC non è disponibile su questo dispositivo.

# readyToScanNfc
source: Ready to scan NFC tags
es: Listo para escanear etiquetas NFC
fr: Prêt à scanner les tags NFC
it: Pronto per scansionare tag NFC

# scanningForNfc
source: Scanning for NFC tags...
es: Escaneando etiquetas NFC...
fr: Recherche de tags NFC...
it: Scansione di tag NFC...

source: Scanning paused
es: Escaneo pausado
fr: Scan en pause
it: Scansione in pausa

source: Start Scanning
es: Iniciar escaneo
fr: Démarrer le scan
it: Avvia scansione

source: Stop Scanning
es: Detener escaneo
fr: Arrêter le scan
it: Ferma scansione

# noFoldersYet
source: No folders yet. Create a folder to organize your songs!
es: Todavía no hay carpetas. ¡Cree una carpeta para organizar sus canciones!
fr: Aucun dossier pour l'instant. Créez un dossier pour organiser vos chansons!
it: Nessuna cartella ancora. Crea una cartella per organizzare le tue canzoni!

source: Add New Folder
es: Agregar nueva carpeta
fr: Ajouter un nouveau dossier
it: Aggiungi nuova cartella

source: Add Audio File
es: Agregar archivo de audio
fr: Ajouter un fichier audio
it: Aggiungi file audio

source: Add New Song
es: Agregar nueva canción
fr: Ajouter une nouvelle chanson
it: Aggiungi nuova canzone

source: Edit Song
es: Editar canción
fr: Modifier la chanson
it: Modifica canzone

source: Playback Options
es: Opciones de reproducción
fr: Options de lecture
it: Opzioni di riproduzione

source: Loop playback
es: Reproducción en bucle
fr: Lecture en boucle
it: Riproduzione in loop

source: Remember position
es: Recordar posición
fr: Mémoriser la position
it: Ricorda posizione

source: NFC Configuration
es: Configuración NFC
fr: Configuration NFC
it: Configurazione NFC

# nfcAssignedReady
source: NFC is assigned and ready
es: NFC está asignado y listo
fr: NFC est assigné et prêt
it: NFC è assegnato e pronto

# waitingForNfc
source: Waiting for NFC tag...
es: Esperando etiqueta NFC...
fr: En attente de tag NFC...
it: In attesa di tag NFC...

# newNfcDetected
source: New NFC detected: {nfcId}...
es: Nuevo NFC detectado: {nfcId}...
fr: Nouveau NFC détecté: {nfcId}...
it: Nuovo NFC rilevato: {nfcId}...

source: Use This NFC
es: Usar este NFC
fr: Utiliser ce NFC
it: Usa questo NFC

source: NFC Tag Already Connected
es: Etiqueta NFC ya conectada
fr: Tag NFC déjà connecté
it: Tag NFC già connesso

# nfcAlreadyConnectedTo
source: This NFC tag is already connected to:
es: Esta etiqueta NFC ya está conectada a:
fr: Ce tag NFC est déjà connecté à:
it: Questo tag NFC è già connesso a:

# replaceConnectionQuestion
source: Do you want to replace the connection?
es: ¿Desea reemplazar la conexión?
fr: Voulez-vous remplacer la connexion?
it: Vuoi sostituire la connessione?

source: Keep Existing
es: Mantener existente
fr: Conserver l'existant
it: Mantieni esistente

source: Replace Connection
es: Reemplazar conexión
fr: Remplacer la connexion
it: Sostituisci connessione

source: Cancel
es: Cancelar
fr: Annuler
it: Annulla

source: Create
es: Crear
fr: Créer
it: Crea

source: Save
es: Guardar
fr: Enregistrer
it: Salva

source: Delete
es: Eliminar
fr: Supprimer
it: Elimina

source: Delete All
es: Eliminar todo
fr: Tout supprimer
it: Elimina tutto

source: Edit Folder
es: Editar carpeta
fr: Modifier le dossier
it: Modifica cartella

source: Delete Folder
es: Eliminar carpeta
fr: Supprimer le dossier
it: Elimina cartella

source: Delete Song
es: Eliminar canción
fr: Supprimer la chanson
it: Elimina canzone

source: Folder Name
es: Nombre de la carpeta
fr: Nom du dossier
it: Nome cartella

source: Audio Source
es: Fuente de audio
fr: Source audio
it: Sorgente audio

source: Title
es: Título
fr: Titre
it: Titolo

# areYouSureDeleteFolder
source: Are you sure you want to delete this folder?
es: ¿Está seguro de que desea eliminar esta carpeta?
fr: Êtes-vous sûr de vouloir supprimer ce dossier?
it: Sei sicuro di voler eliminare questa cartella?

# songsInFolder
source: Songs in folder: {count}
es: Canciones en la carpeta: {count}
fr: Chansons dans le dossier: {count}
it: Canzoni nella cartella: {count}

# noteDeleteSongs
source: Note: All songs in this folder and their audio files will also be deleted.
es: Nota: Todas las canciones en esta carpeta y sus archivos de audio también se eliminarán.
fr: Note: Toutes les chansons dans ce dossier et leurs fichiers audio seront également supprimés.
it: Nota: Tutte le canzoni in questa cartella e i loro file audio verranno eliminati.

# areYouSureDeleteSong
source: Are you sure you want to delete this song?
es: ¿Está seguro de que desea eliminar esta canción?
fr: Êtes-vous sûr de vouloir supprimer cette chanson?
it: Sei sicuro di voler eliminare questa canzone?

# nfcMappingRemoved
source: This will also remove the NFC mapping for: {nfcId}
es: Esto también eliminará el mapeo NFC para: {nfcId}
fr: Cela supprimera également le mappage NFC pour: {nfcId}
it: Questo rimuoverà anche la mappatura NFC per: {nfcId}

# audioFileDeleted
source: The audio file will also be deleted from the app storage.
es: El archivo de audio también se eliminará del almacenamiento de la aplicación.
fr: Le fichier audio sera également supprimé du stockage de l'application.
it: Il file audio verrà eliminato anche dallo storage dell'app.

source: Upgrade to Premium
es: Actualizar a Premium
fr: Passer à Premium
it: Passa a Premium

# freeVersionLimit
source: In the free version you can add up to 2 folders with 6 audio files each.
es: En la versión gratuita, puede agregar hasta 2 carpetas con 6 archivos de audio cada una.
fr: Dans la version gratuite, vous pouvez ajouter jusqu'à 2 dossiers avec 6 fichiers audio chacun.
it: Nella versione gratuita puoi aggiungere fino a 2 cartelle con 6 file audio ciascuna.

# upgradeToUnlock
source: Upgrade to Premium to unlock unlimited folders and audio files, and support the developers!
es: Actualice a Premium para desbloquear carpetas y archivos de audio ilimitados, ¡y apoye a los desarrolladores!
fr: Passez à Premium pour débloquer des dossiers et fichiers audio illimités, et soutenir les développeurs!
it: Passa a Premium per sbloccare cartelle e file audio illimitati e supportare gli sviluppatori!

source: Later
es: Más tarde
fr: Plus tard
it: Più tardi

source: Upgrade
es: Actualizar
fr: Mettre à niveau
it: Aggiorna

source: 🗄️ Storage Debug
es: 🗄️ Depuración de almacenamiento
fr: 🗄️ Débogage du stockage
it: 🗄️ Debug storage

source: Storage Service Status:
es: Estado del servicio de almacenamiento:
fr: État du service de stockage:
it: Stato del servizio di storage:

# initialized
source: Initialized: {status}
es: Inicializado: {status}
fr: Initialisé: {status}
it: Inizializzato: {status}

# platform
source: Platform: {platform}
es: Plataforma: {platform}
fr: Plateforme: {platform}
it: Piattaforma: {platform}

source: Storage Statistics:
es: Estadísticas de almacenamiento:
fr: Statistiques de stockage:
it: Statistiche di storage:

source: IAP/Premium Status:
es: Estado de IAP/Premium:
fr: État IAP/Premium:
it: Stato IAP/Premium:

# premiumNotAvailable
source: Premium: N/A (non-GP flavor)
es: Premium: No disponible (versión no GP)
fr: Premium: Non disponible (version non GP)
it: Premium: Non disponibile (versione non GP)

source: Log Debug Info
es: Registrar información de depuración
fr: Journaliser les informations de débogage
it: Registra info di debug

source: Force Reinitialize
es: Forzar reinicialización
fr: Forcer la réinitialisation
it: Forza reinizializzazione

source: Clear All Data
es: Borrar todos los datos
fr: Effacer toutes les données
it: Cancella tutti i dati

source: Log Premium Status
es: Registrar estado premium
fr: Journaliser l'état premium
it: Registra stato premium

source: Clear Premium Status
es: Borrar estado premium
fr: Effacer l'état premium
it: Cancella stato premium

source: Close
es: Cerrar
fr: Fermer
it: Chiudi

source: 🔍 Debug Information
es: 🔍 Información de depuración
fr: 🔍 Informations de débogage
it: 🔍 Informazioni di debug

source: NFC Service Status:
es: Estado del servicio NFC:
fr: État du service NFC:
it: Stato del servizio NFC:

# nfcAvailable
source: NFC Available: {status}
es: NFC disponible: {status}
fr: NFC disponible: {status}
it: NFC disponibile: {status}

# nfcScanning
source: NFC Scanning: {status}
es: Escaneo NFC: {status}
fr: Scan NFC: {status}
it: Scansione NFC: {status}

# currentUuid
source: Current UUID: {uuid}
es: UUID actual: {uuid}
fr: UUID actuel: {uuid}
it: UUID corrente: {uuid}

source: Music Player Status:
es: Estado del reproductor de música:
fr: État du lecteur de musique:
it: Stato del lettore musicale:

# currentState
source: Current State: {state}
es: Estado actual: {state}
fr: État actuel: {state}
it: Stato corrente: {state}

# isPlaying
source: Is Playing: {status}
es: Se está reproduciendo: {status}
fr: En lecture: {status}
it: In riproduzione: {status}

# isPaused
source: Is Paused: {status}
es: Está pausado: {status}
fr: En pause: {status}
it: In pausa: {status}

# currentFile
source: Current File: {file}
es: Archivo actual: {file}
fr: Fichier actuel: {file}
it: File corrente: {file}

source: Songs & Mappings:
es: Canciones y mapeos:
fr: Chansons et mappages:
it: Canzoni e mappature:

# totalSongs
source: Total Songs: {count}
es: Total de canciones: {count}
fr: Total de chansons: {count}
it: Totale canzoni: {count}

# songWithUuid
source: Song {index}: {title} (UUID: {uuid})
es: Canción {index}: {title} (UUID: {uuid})
fr: Chanson {index}: {title} (UUID: {uuid})
it: Canzone {index}: {title} (UUID: {uuid})

source: Flavor Information:
es: Información de sabor:
fr: Informations sur la version:
it: Informazioni sulla versione:

# githubRelease
source: GitHub Release: {status}
es: Versión de GitHub: {status}
fr: Version GitHub: {status}
it: Versione GitHub: {status}

# fdroidRelease
source: F-Droid Release: {status}
es: Versión de F-Droid: {status}
fr: Version F-Droid: {status}
it: Versione F-Droid: {status}

# googlePlayRelease
source: Google Play Release: {status}
es: Versión de Google Play: {status}
fr: Version Google Play: {status}
it: Versione Google Play: {status}

source: Test Player State
es: Probar estado del reproductor
fr: Tester l'état du lecteur
it: Testa stato del lettore

source: Force Process UUID
es: Forzar procesamiento de UUID
fr: Forcer le traitement de l'UUID
it: Forza elaborazione UUID

source: Reset Tutorial
es: Restablecer tutorial
fr: Réinitialiser le didacticiel
it: Reimposta tutorial

# importQuestion
source: Import "{name}"?
es: ¿Importar "{name}"?
fr: Importer "{name}"?
it: Importare "{name}"?

# importDescription
source: This will download {count} audio files and create a new folder.
es: Esto descargará {count} archivos de audio y creará una nueva carpeta.
fr: Cela téléchargera {count} fichiers audio et créera un nouveau dossier.
it: Questo scaricherà {count} file audio e creerà una nuova cartella.

# importButton
source: Import
es: Importar
fr: Importer
it: Importa

source: Downloading audio files...
es: Descargando archivos de audio...
fr: Téléchargement des fichiers audio...
it: Scaricamento file audio...

# importSuccess
source: Successfully imported "{name}"
es: "{name}" importado correctamente
fr: "{name}" importé avec succès
it: "{name}" importato con successo

# importFailed
source: Failed to import any files from "{name}"
es: No se pudieron importar archivos de "{name}"
fr: Échec de l'importation de fichiers depuis "{name}"
it: Impossibile importare file da "{name}"

source: Partial Import
es: Importación parcial
fr: Importation partielle
it: Importazione parziale

# importedFiles
source: Imported {success} files, but {failed} files failed to download:
es: Se importaron {success} archivos, pero {failed} archivos no se pudieron descargar:
fr: Fichiers importés: {success}, mais {failed} fichiers n'ont pas pu être téléchargés:
it: Importati {success} file, ma {failed} file non sono stati scaricati:

# failedToImport
source: Failed to import folder: {error}
es: Error al importar la carpeta: {error}
fr: Échec de l'importation du dossier: {error}
it: Impossibile importare la cartella: {error}

# updateAvailable
source: Update v{version} available
es: Actualización v{version} disponible
fr: Mise à jour v{version} disponible
it: Aggiornamento v{version} disponibile

# newVersionAvailable
source: A new version is available on GitHub.
es: Una nueva versión está disponible en GitHub.
fr: Une nouvelle version est disponible sur GitHub.
it: Una nuova versione è disponibile su GitHub.

source: Changelog:
es: Registro de cambios:
fr: Journal des modifications:

# noChangelog
source: No changelog provided.
es: No se proporcionó registro de cambios.
fr: Aucun journal des modifications fourni.
it: Nessun changelog fornito.

# downloadUpdate
source: Download
es: Descargar
fr: Télécharger
it: Scarica

# latestVersion
source: You are on the latest version.
es: Tienes la última versión.
fr: Vous avez la dernière version.
it: Hai l'ultima versione.

# updateCheckFailed
source: Error checking for updates: {error}
es: Error al verificar actualizaciones: {error}
fr: Erreur lors de la vérification des mises à jour: {error}
it: Errore nel controllo degli aggiornamenti: {error}

# loadedData
source: 🎵 Loaded your saved songs, folders, and NFC mappings!
es: 🎵 ¡Se cargaron tus canciones, carpetas y mapeos NFC guardados!
fr: 🎵 Vos chansons, dossiers et mappages NFC enregistrés ont été chargés!
it: 🎵 Caricate le tue canzoni, cartelle e mappature NFC salvate!

# failedToLoadData
source: ⚠️ Failed to load saved data. App will work with empty data.
es: ⚠️ Error al cargar los datos guardados. La aplicación funcionará con datos vacíos.
fr: ⚠️ Échec du chargement des données enregistrées. L'application fonctionnera avec des données vides.
it: ⚠️ Impossibile caricare i dati salvati. L'app funzionerà con dati vuoti.

source: Could not load templates.
es: No se pudieron cargar las plantillas.
fr: Impossible de charger les modèles.
it: Impossibile caricare i modelli.

source: Retry
es: Reintentar
fr: Réessayer
it: Riprova

# nfcLinkedAutomatically
source: 🔗 NFC tag linked automatically
es: 🔗 Etiqueta NFC vinculada automáticamente
fr: 🔗 Tag NFC lié automatiquement
it: 🔗 Tag NFC collegato automaticamente

# audioSelected
source: 📥 Audio selected: {name}
es: 📥 Audio seleccionado: {name}
fr: 📥 Audio sélectionné: {name}
it: 📥 Audio selezionato: {name}

# rejectedInvalidAudio
source: ❌ Rejected: Selected file is not a valid audio file.
es: ❌ Rechazado: El archivo seleccionado no es un archivo de audio válido.
fr: ❌ Rejeté: Le fichier sélectionné n'est pas un fichier audio valide.
it: ❌ Rifiutato: Il file selezionato non è un file audio valido.

# cannotSaveInvalidAudio
source: ❌ Cannot save: File is not a valid audio file.
es: ❌ No se puede guardar: El archivo no es un archivo de audio válido.
fr: ❌ Impossible d'enregistrer: Le fichier n'est pas un fichier audio valide.
it: ❌ Impossibile salvare: Il file non è un file audio valido.

source: ❌ Failed to launch audio picker
es: ❌ Error al iniciar el selector de audio
fr: ❌ Échec du lancement du sélecteur audio
it: ❌ Impossibile avviare il selettore audio

# nfcTagLinked
source: 🔗 NFC tag linked automatically
es: 🔗 Etiqueta NFC vinculada automáticamente
fr: 🔗 Tag NFC lié automatiquement
it: 🔗 Tag NFC collegato automaticamente

source: Storage reinitialized
es: Almacenamiento reinicializado
fr: Stockage réinitialisé
it: Storage reinizializzato

# reinitializationFailed
source: Reinitialization failed: {error}
es: Error en la reinicialización: {error}
fr: Échec de la réinitialisation: {error}
it: Reinizializzazione fallita: {error}

source: All storage data cleared
es: Todos los datos de almacenamiento borrados
fr: Toutes les données de stockage effacées
it: Tutti i dati di storage cancellati

# clearFailed
source: Clear failed: {error}
es: Error al borrar: {error}
fr: Échec de l'effacement: {error}
it: Cancellazione fallita: {error}

# storageDebugInfoLogged
source: Storage debug info logged to console
es: Información de depuración de almacenamiento registrada en la consola
fr: Informations de débogage du stockage journalisées dans la console
it: Info di debug del storage registrate nella console

# debugInfoLogged
source: Debug info logged to console
es: Información de depuración registrada en la consola
fr: Informations de débogage journalisées dans la console
it: Info di debug registrate nella console

# stateTestLogged
source: State test logged to console
es: Prueba de estado registrada en la consola
fr: Test d'état journalisé dans la console
it: Test di stato registrato nella console

# nfcOperationFailed
source: NFC operation failed: {error}
es: Operación NFC fallida: {error}
fr: Opération NFC échouée: {error}
it: Operazione NFC fallita: {error}

# forceProcessedUuid
source: Force processed current UUID
es: UUID actual procesado forzadamente
fr: UUID actuel traité de force
it: UUID corrente elaborato forzatamente

# tutorialReset
source: Tutorial reset - will show on next restart
es: Tutorial reiniciado: se mostrará en el próximo reinicio
fr: Didacticiel réinitialisé - s'affichera au prochain redémarrage
it: Tutorial reimpostato - verrà mostrato al prossimo riavvio

# failedToOpenLink
source: ❌ Failed to open link: {error}
es: ❌ Error al abrir el enlace: {error}
fr: ❌ Échec de l'ouverture du lien: {error}
it: ❌ Impossibile aprire il link: {error}

source: Slide to lock
fr: Faire glisser pour verrouiller
it: Scorri per bloccare

source: Screen Locked
fr: Écran verrouillé
it: Schermo bloccato

# swipeUpToUnlock
source: 3-Finger Swipe Up to Unlock
fr: Faites glisser 3 doigts vers le haut pour déverrouiller
it: Scorri con 3 dita verso l'alto per sbloccare

# tutorialAddFolderTitle
source: Create Music Collections
fr: Créer des collections musicales
it: Crea collezioni musicali

# tutorialAddFolderDesc
source: Tap "Add New Folder" to create folders and organize your audio files collection.
fr: Appuyez sur "Ajouter un nouveau dossier" pour créer des dossiers et organiser votre collection de fichiers audio.
it: Tocca "Aggiungi nuova cartella" per creare cartelle e organizzare la tua collezione di file audio.

# tutorialAddSongTitle
source: Add Your Songs
fr: Ajoutez vos chansons
it: Aggiungi le tue canzoni

# tutorialAddSongDesc
source: Once a folder is created, tap "Add Audio File" to select audio files from your device.
fr: Une fois qu'un dossier est créé, appuyez sur "Ajouter un fichier audio" pour sélectionner des fichiers audio sur votre appareil.
it: Una volta creata una cartella, tocca "Aggiungi file audio" per selezionare i file audio dal tuo dispositivo.

# tutorialAttachFileTitle
source: Select Audio File
fr: Sélectionner un fichier audio
it: Seleziona file audio

# tutorialAttachFileDesc
source: Tap the paperclip icon to select an audio file from your device.
fr: Appuyez sur l'icône du trombone pour sélectionner un fichier audio sur votre appareil.
it: Tocca l'icona della graffetta per selezionare un file audio dal tuo dispositivo.

# tutorialConnectNfcTitle
source: Connect NFC Tag
fr: Connecter un tag NFC
it: Collega tag NFC

# tutorialConnectNfcDesc
source: Near any NFC tag to the back of your phone until it vibrates to connect the tag to the audio file for playback.
fr: Approchez n'importe quel tag NFC de l'arrière de votre téléphone jusqu'à ce qu'il vibre pour connecter le tag au fichier audio pour la lecture.
it: Avvicina un qualsiasi tag NFC al retro del tuo telefono finché non vibra per collegare il tag al file audio per la riproduzione.

# tutorialSettingsTitle
source: Settings & Starter Packs
fr: Paramètres et packs de démarrage
it: Impostazioni e pacchetti di avvio

# tutorialSettingsDesc
source: Open the settings menu to find audio starter packs and other options.
fr: Ouvrez le menu des paramètres pour trouver des packs de démarrage audio et d'autres options.
it: Apri il menu delle impostazioni per trovare i pacchetti audio di avvio e altre opzioni.

source: Limit Reached
fr: Limite atteinte

# folderLimitReached
source: You have reached the limit of 2 folders. To add more, please upgrade to the premium version.
fr: Vous avez atteint la limite de 2 dossiers. Pour en ajouter plus, veuillez passer à la version premium.

# songLimitReached
source: You have reached the limit of 6 songs per folder. To add more, please upgrade to the premium version.
fr: Vous avez atteint la limite de 6 chansons par dossier. Pour en ajouter plus, veuillez passer à la version premium.

source: Theme Color
fr: Couleur du thème

# lastDetected
source: Last detected: {uuid}
fr: Dernier détecté : {uuid}

# nowPlaying
source: Now Playing: {title}
fr: Lecture en cours : {title}

# assignedNfc
source: Assigned NFC: {id}...
fr: NFC assigné : {id}...

source: Edit
fr: Modifier

source: Connected
fr: Connecté

source: NFC scanning started
fr: Scan NFC démarré

source: NFC scanning stopped
fr: Scan NFC arrêté

source: Stop NFC
fr: Arrêter le NFC

source: Start NFC
fr: Démarrer le NFC

# storageError
source: Storage Error: Failed to {operation}. Error: {error}
fr: Erreur de stockage : Échec de {operation}. Erreur : {error}

source: White
fr: Blanc

source: Black
fr: Noir

# needNfcTagsTitle
source: Need NFC Tags?
fr: Envie d'un petit extra?

source: Actions:
es: Acciones:
it: Azioni:

# position
source: Position: {position}
es: Posición: {position}
it: Posizione: {position}
